# Case Study on Measures of Central Tendency and Dispersion

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
data=pd.read_csv('StudentsPerformance.csv')

# 1. Find out how many males and females participated in the test.

In [9]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [11]:
data['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# 2. What do you think about the students' parental level of education?

In [12]:
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

# 3. Who scores the most on average for math, reading and writing based on
● Gender

In [15]:
data2=data.groupby(['gender']).mean(max)

In [16]:
data2

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [38]:
data3=data2.sort_values(by=['math score','reading score','writing score'],ascending=True)
data3.head(1)

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181

# 3. Who scores the most on average for math, reading and writing based on

● Test preparation course

In [39]:
data2=data.groupby(['test preparation course']).mean(max)
data2

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [42]:
data4=data2.sort_values(by=['math score','reading score','writing score'],ascending=False)
data4.head(1)

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358

# 4. What do you think about the scoring variation for math, reading and writing
based on
● Gender

In [48]:
data2=data.groupby(['gender']).var()

In [46]:
data2

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

# 4. What do you think about the scoring variation for math, reading and writing
based on

● Test preparation course

In [53]:
data2=data.groupby(['test preparation course']).var()
data2

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

# 5. The management needs your help to give bonus points to the top 25% of
students based on their maths score, so how will you help the management
to achieve this.

In [62]:
data2=data.groupby(['math score','reading score','writing score'])